tutorials4NF/steadyStateForcedConvection4NF/turbulatorMonoNEPCMHomogenous/case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0.01;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0.1;
    }
    k
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0.1;
    }
    epsilon
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0.1;
    }
    R
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0.1;
    }
    nuTilda
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0.1;
    }
    //-NFFOam
    "(T|alphai|alpha_AL2O3)"
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;

    residualControl
    {
        p               1e-4;
        U               1e-5;
        "(k|epsilon)"   1e-4;
        T               1e-6;//-NFFOam
        alpha_AL2O3     1e-4;//-NFFOam
    }
}

relaxationFactors
{
    fields
    {
        p               0.7;
    }

    equations
    {
        U               0.7;
        k               0.7;
        epsilon         0.7;
        R               0.7;
        nuTilda         0.7;
        T               0.7;//-NFFOam
        alpha_AL2O3     0.7;//-NFFOam
    }
}

cache
{
    grad(U);
    grad(T);
    grad(p);
    grad(k);
    grad(omega);
    grad(epsilon);
}


// ************************************************************************* //
